Installed Leaves:
=================
advancecomp
bash-completion
cscope
csshx
dvdbackup
elm
ghostscript
gifsicle
git
git-flow
gnu-sed
imagemagick
jhead
jpegoptim
lzo
mongodb
nodenv
nvm
optipng
p7zip
pngcrush
jonof/kenutils/pngout
pngquant
purescript
rbenv
vim
watchman
yarn
yuicompressor

All Installed:
==============
advancecomp
autoconf
bash-completion
cscope
csshx
dvdbackup
elm
freetype
gdbm
gettext
ghostscript
gifsicle
git
git-flow
glib
gnu-sed
icu4c
ilmbase
imagemagick
jhead
jpeg
jpegoptim
libde265
libdvdcss
libdvdread
libffi
libheif
libomp
libpng
libtiff
libtool
libyaml
little-cms2
lua
lzo
mongodb
node
node-build
nodenv
nvm
openexr
openjpeg
openssl
optipng
p7zip
pcre
pcre2
perl
pkg-config
pngcrush
pngout
pngquant
purescript
python
python@2
rbenv
readline
ruby
ruby-build
shared-mime-info
sqlite
vim
watchman
webp
x265
xz
yarn
yuicompressor

Dependencies:
=============
advancecomp: 
autoconf: 
bash-completion: 
cscope: 
csshx: 
dvdbackup: libdvdcss libdvdread
elm: 
freetype: libpng
gdbm: 
gettext: 
ghostscript: jpeg libtiff
gifsicle: 
git: gettext pcre2
git-flow: 
glib: gdbm gettext libffi openssl pcre python readline sqlite xz
gnu-sed: 
icu4c: 
ilmbase: 
imagemagick: freetype gdbm gettext glib ilmbase jpeg libde265 libffi libheif libomp libpng libtiff libtool little-cms2 openexr openjpeg openssl pcre python readline shared-mime-info sqlite webp x265 xz
jhead: 
jpeg: 
jpegoptim: jpeg
libde265: 
libdvdcss: 
libdvdread: libdvdcss
libffi: 
libheif: gdbm gettext glib jpeg libde265 libffi libpng openssl pcre python readline shared-mime-info sqlite x265 xz
libomp: 
libpng: 
libtiff: jpeg
libtool: 
libyaml: 
little-cms2: jpeg libtiff
lua: 
lzo: 
mongodb: gdbm openssl python@2 readline sqlite
node: icu4c
node-build: autoconf openssl pkg-config
nodenv: autoconf node-build openssl pkg-config
nvm: 
openexr: ilmbase
openjpeg: jpeg libpng libtiff little-cms2
openssl: 
optipng: 
p7zip: 
pcre: 
pcre2: 
perl: 
pkg-config: 
pngcrush: 
jonof/kenutils/pngout: 
pngquant: jpeg libpng libtiff little-cms2
purescript: 
python: gdbm openssl readline sqlite xz
python@2: gdbm openssl readline sqlite
rbenv: autoconf openssl pkg-config ruby-build
readline: 
ruby: libyaml openssl readline
ruby-build: autoconf openssl pkg-config
shared-mime-info: gdbm gettext glib libffi openssl pcre python readline sqlite xz
sqlite: readline
vim: gdbm gettext libyaml lua openssl perl python readline ruby sqlite xz
watchman: gdbm openssl pcre python readline sqlite xz
webp: jpeg libpng libtiff
x265: 
xz: 
yarn: icu4c node
yuicompressor: 

Casks:
======
adobe-acrobat-reader
android-studio
atom
bitwarden
caffeine
coconutbattery
cyberduck
db-browser-for-sqlite
dolphin
filezilla
firefox
google-chrome
google-chrome-canary
gramps
handbrake
intellij-idea-ce
iterm2
jing
keka
keybase
licecap
macpass
macs-fan-control
mactex
macvim
mongodb-compass-community
p4merge
phantomjs
postman
pycharm
slack
sourcetree
spectacle
spotify
typora
vagrant
virtualbox
visual-studio-code
vlc
workarea-cli
xquartz
zoomus
